# -*- coding: utf-8 -*-
from networkx import *
import matplotlib.pyplot as plt

c = [(17, 12), (19, 9), (34, 41), (35, 2), (15, 20), (4, 8), (12, 24), (1, 32), (13, 4), (33, 30), (10, 46),\
    (41, 0), (30, 3), (8, 49), (39, 43), (43, 23), (24, 33), (7, 5), (11, 10), (2, 15), (3, 20), (22, 15),\
    (47, 37), (37, 6), (16, 25), (23, 11), (36, 45), (26, 19), (13, 36), (42, 38), (27, 42), (28, 14),\
    (38, 31), (5, 35), (49, 40), (10, 39), (32, 22), (12, 48), (21, 27), (18, 29), (25, 44), (40, 47),\
    (6, 10), (44, 7), (29, 34), (46, 13), (45, 18), (48, 28), (25, 1), (20, 21)]

C1 = [11, 10, 20, 21, 46, 29, 35, 5, 8]
C2 = [49, 33, 18, 37, 43, 36, 2]
C3 = [24, 38, 17, 40, 41, 19, 7]
C4 = [45, 14, 16, 23, 30]
C5 = [39, 15, 25]
C6 = [25, 19, 44, 42]
C7 = [1, 32, 37, 23]
C8 = [31, 2, 6]
C9 = [45, 44, 30]
C_ORI = [u'28', u'48', u'43', u'49', u'24', u'25', u'26', u'27', u'20', u'21', u'22', u'23', u'46', u'47', u'44', u'45', u'42', u'29', u'40', u'41', u'1', u'0', u'3', u'2', u'5', u'4', u'7', u'6', u'9', u'8', u'13', u'12', u'11', u'10', u'39', u'38', u'15', u'14', u'17', u'16', u'33', u'32', u'31', u'30', u'37', u'36', u'35', u'34', u'19', u'18']

E1 = [[21, 11], [21, 10], [11, 10], [8, 11], [8, 35], [11, 35], [5, 35], [5, 8], [20, 46], [20, 5], [46, 5], [20, 8], [29, 20], [29, 8], [29, 21], [20, 21], [21, 8], [21, 46]]
E2 = [[49, 36], [49, 2], [2, 36], [49, 37], [2, 37], [49, 43], [43, 2], [49, 33], [43, 33], [49, 18], [18, 37]]
E3 = [[24, 40], [24, 7], [40, 7], [24, 41], [41, 7], [46, 19], [46, 7], [7, 19], [7, 11], [11, 19], [40, 11], [24, 17], [40, 17], [41, 17], [40, 38], [38, 17], [41, 38]]
E4 = [[30, 10], [30, 49], [49, 10], [30, 45], [45, 10], [30, 16], [45, 16], [20, 16], [20, 45], [30, 20], [30, 46], [20, 46], [30, 14], [46, 14], [46, 23], [14, 23], [30, 23], [10, 23]]
E5 = [[10, 15], [10, 36], [15, 36], [39, 15], [39, 36], [25, 10], [25, 15], [30, 10], [30, 15], [25, 8], [8, 15], [30, 25], [30, 46], [25, 46], [25, 39]]
E6 = [[44, 11], [44, 8], [8, 11], [44, 15], [8, 15], [25, 15], [25, 8], [44, 42], [42, 8], [25, 19], [25, 42], [42, 19]]
E7 = [[1, 23], [1, 32], [23, 32], [1, 37], [23, 37]]
E8 = [[2, 31], [2, 6], [6, 31]]
E9 = [[30, 10], [30, 45], [45, 10], [44, 45], [44, 16], [45, 16], [30, 16], [20, 16], [20, 45], [30, 20], [30, 44]]
E_ORI = [(u'30', u'10'), (u'30', u'45'), (u'30', u'20'), (u'30', u'14'), (u'30', u'17'), (u'30', u'16'), (u'30', u'46'), (u'30', u'44'), (u'30', u'23'), (u'30', u'25'), (u'30', u'49'), (u'30', u'15'), (u'28', u'10'), (u'28', u'14'), (u'28', u'33'), (u'28', u'43'), (u'28', u'40'), (u'28', u'29'), (u'28', u'3'), (u'28', u'2'), (u'22', u'24'), (u'22', u'26'), (u'22', u'20'), (u'22', u'19'), (u'22', u'47'), (u'22', u'36'), (u'22', u'34'), (u'22', u'5'), (u'22', u'4'), (u'29', u'13'), (u'29', u'27'), (u'29', u'20'), (u'29', u'21'), (u'29', u'38'), (u'29', u'47'), (u'29', u'45'), (u'29', u'36'), (u'29', u'40'), (u'29', u'43'), (u'29', u'3'), (u'29', u'2'), (u'29', u'6'), (u'29', u'8'), (u'24', u'26'), (u'24', u'17'), (u'24', u'35'), (u'24', u'34'), (u'24', u'40'), (u'24', u'7'), (u'24', u'9'), (u'24', u'41'), (u'25', u'10'), (u'25', u'39'), (u'25', u'12'), (u'25', u'15'), (u'25', u'19'), (u'25', u'42'), (u'25', u'35'), (u'25', u'33'), (u'25', u'46'), (u'25', u'8'), (u'26', u'16'), (u'26', u'43'), (u'26', u'31'), (u'26', u'45'), (u'26', u'36'), (u'26', u'41'), (u'26', u'1'), (u'26', u'49'), (u'26', u'8'), (u'27', u'20'), (u'27', u'14'), (u'27', u'19'), (u'27', u'18'), (u'27', u'43'), (u'27', u'35'), (u'27', u'41'), (u'27', u'1'), (u'27', u'36'), (u'27', u'4'), (u'27', u'6'), (u'20', u'21'), (u'20', u'17'), (u'20', u'16'), (u'20', u'46'), (u'20', u'32'), (u'20', u'45'), (u'20', u'36'), (u'20', u'40'), (u'20', u'34'), (u'20', u'3'), (u'20', u'5'), (u'20', u'47'), (u'20', u'8'), (u'20', u'31'), (u'21', u'11'), (u'21', u'10'), (u'21', u'13'), (u'21', u'17'), (u'21', u'49'), (u'21', u'46'), (u'21', u'32'), (u'21', u'44'), (u'21', u'23'), (u'21', u'43'), (u'21', u'41'), (u'21', u'1'), (u'21', u'3'), (u'21', u'8'), (u'48', u'10'), (u'48', u'18'), (u'48', u'31'), (u'48', u'45'), (u'48', u'40'), (u'48', u'34'), (u'48', u'3'), (u'48', u'8'), (u'49', u'11'), (u'49', u'10'), (u'49', u'33'), (u'49', u'18'), (u'49', u'37'), (u'49', u'36'), (u'49', u'43'), (u'49', u'2'), (u'49', u'32'), (u'49', u'8'), (u'46', u'13'), (u'46', u'12'), (u'46', u'14'), (u'46', u'23'), (u'46', u'19'), (u'46', u'18'), (u'46', u'37'), (u'46', u'43'), (u'46', u'34'), (u'46', u'38'), (u'46', u'5'), (u'46', u'7'), (u'46', u'6'), (u'46', u'9'), (u'47', u'13'), (u'47', u'12'), (u'47', u'14'), (u'47', u'33'), (u'47', u'44'), (u'47', u'35'), (u'47', u'36'), (u'47', u'38'), (u'47', u'15'), (u'44', u'11'), (u'44', u'39'), (u'44', u'45'), (u'44', u'15'), (u'44', u'16'), (u'44', u'42'), (u'44', u'41'), (u'44', u'8'), (u'45', u'11'), (u'45', u'10'), (u'45', u'13'), (u'45', u'16'), (u'45', u'1'), (u'45', u'0'), (u'45', u'8'), (u'42', u'39'), (u'42', u'12'), (u'42', u'19'), (u'42', u'36'), (u'42', u'40'), (u'42', u'34'), (u'42', u'0'), (u'42', u'8'), (u'43', u'13'), (u'43', u'23'), (u'43', u'33'), (u'43', u'32'), (u'43', u'16'), (u'43', u'2'), (u'43', u'4'), (u'40', u'11'), (u'40', u'10'), (u'40', u'38'), (u'40', u'17'), (u'40', u'31'), (u'40', u'7'), (u'40', u'6'), (u'41', u'13'), (u'41', u'17'), (u'41', u'23'), (u'41', u'2'), (u'41', u'5'), (u'41', u'7'), (u'41', u'38'), (u'1', u'23'), (u'1', u'33'), (u'1', u'32'), (u'1', u'37'), (u'1', u'5'), (u'1', u'18'), (u'0', u'14'), (u'0', u'23'), (u'0', u'18'), (u'0', u'36'), (u'0', u'35'), (u'0', u'4'), (u'0', u'6'), (u'3', u'10'), (u'3', u'16'), (u'3', u'33'), (u'3', u'23'), (u'3', u'36'), (u'3', u'35'), (u'3', u'7'), (u'3', u'9'), (u'2', u'19'), (u'2', u'31'), (u'2', u'37'), (u'2', u'36'), (u'2', u'6'), (u'5', u'39'), (u'5', u'38'), (u'5', u'17'), (u'5', u'16'), (u'5', u'33'), (u'5', u'13'), (u'5', u'35'), (u'5', u'4'), (u'5', u'19'), (u'5', u'8'), (u'4', u'13'), (u'4', u'12'), (u'4', u'14'), (u'4', u'31'), (u'4', u'36'), (u'7', u'11'), (u'7', u'19'), (u'7', u'33'), (u'7', u'18'), (u'6', u'11'), (u'6', u'14'), (u'6', u'16'), (u'6', u'31'), (u'9', u'11'), (u'9', u'16'), (u'9', u'31'), (u'9', u'35'), (u'9', u'8'), (u'8', u'11'), (u'8', u'15'), (u'8', u'17'), (u'8', u'18'), (u'8', u'35'), (u'39', u'11'), (u'39', u'13'), (u'39', u'15'), (u'39', u'16'), (u'39', u'36'), (u'38', u'10'), (u'38', u'15'), (u'38', u'14'), (u'38', u'17'), (u'38', u'37'), (u'11', u'10'), (u'11', u'19'), (u'11', u'35'), (u'11', u'31'), (u'10', u'13'), (u'10', u'15'), (u'10', u'19'), (u'10', u'18'), (u'10', u'36'), (u'10', u'12'), (u'10', u'23'), (u'13', u'36'), (u'13', u'18'), (u'12', u'17'), (u'12', u'33'), (u'12', u'37'), (u'12', u'35'), (u'15', u'32'), (u'15', u'36'), (u'14', u'23'), (u'14', u'37'), (u'17', u'33'), (u'17', u'37'), (u'16', u'33'), (u'16', u'35'), (u'16', u'34'), (u'33', u'19'), (u'18', u'37'), (u'18', u'35'), (u'18', u'34'), (u'31', u'35'), (u'23', u'32'), (u'23', u'37'), (u'37', u'19'), (u'37', u'35'), (u'36', u'32'), (u'36', u'34')]

C_All = C1 + C2 + C3 + C4 + C5 + C6
E_All = E1 + E2 + E3 + E4 + E5 + E6

K = nx.Graph()

# เปลี่ยน โหนด ทั้งหมดเป็น int
ND = []
for hh in C_ORI:
    hh = int(hh)
    ND.append(hh)

pos = {}
m = 0
for u in ND:
    pos[u] = c[m]
    m += 1

K.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    K.node[n]['pos'] = p

# เปลี่ยน กิ่งทั้งหมดเป็น int
Ed = []
for h in E_ORI:
    keep = []
    for i in h:
        i = int(i)
        keep.append(i)
    Ed.append(keep)

for v in Ed:
    K.add_edge(v[0], v[1])

draw(K, pos, edge_color='c', node_color='black' )  # font_color = 'white'
# plt.show()

# ------------- เริ่มวาดกราฟครัสเตอร์ ------------- #
G = nx.Graph()
# ---- C 1 ---- #
C1_S = set(C1)
E1_1 = []
for ee in E1:
    ee_s = set(ee)
    a = C1_S & ee_s
    if len(a) == 2:
        E1_1.append(ee)
pos = {}
m = 0
for q in C1:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E1_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='red')
# plt.show()

# ---- C 2 ---- #
pos = {}
G.clear()

C2_S = set(C2)
E2_1 = []
for ee in E2:
    ee_s = set(ee)
    a = C2_S & ee_s
    if len(a) == 2:
        E2_1.append(ee)
for q in C2:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E2_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='blue')
# plt.show()

# ---- C 3 ---- #
pos = {}
G.clear()

C3_S = set(C3)
E3_1 = []
for ee in E3:
    ee_s = set(ee)
    a = C3_S & ee_s
    if len(a) == 2:
        E3_1.append(ee)
for q in C3:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E3_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='green')
# plt.show()

# ---- C 4 ---- #
pos = {}
G.clear()

C4_S = set(C4)
E4_1 = []
for ee in E4:
    ee_s = set(ee)
    a = C4_S & ee_s
    if len(a) == 2:
        E4_1.append(ee)
for q in C4:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E4_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='yellow')
# plt.show()

# ---- C 5 ---- #
pos = {}
G.clear()

C5_S = set(C5)
E5_1 = []
for ee in E5:
    ee_s = set(ee)
    a = C5_S & ee_s
    if len(a) == 2:
        E5_1.append(ee)
for q in C5:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E5_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='purple')
plt.show()

# ---- C 6 ---- #
pos = {}
G.clear()

C6_S = set(C6)
E6_1 = []
for ee in E6:
    ee_s = set(ee)
    a = C6_S & ee_s
    if len(a) == 2:
        E6_1.append(ee)
for q in C6:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E6_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='magenta')
# plt.show()

# ---- C 7 ---- #
pos = {}
G.clear()

C7_S = set(C7)
E7_1 = []
for ee in E7:
    ee_s = set(ee)
    a = C7_S & ee_s
    if len(a) == 2:
        E7_1.append(ee)
for q in C7:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E7_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='GreenYellow')
# plt.show()

# ---- C 8 ---- #
pos = {}
G.clear()

C8_S = set(C8)
E8_1 = []
for ee in E8:
    ee_s = set(ee)
    a = C8_S & ee_s
    if len(a) == 2:
        E8_1.append(ee)
for q in C8:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E8_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='brown')
# plt.show()

# ---- C 9 ---- #
pos = {}
G.clear()

C9_S = set(C9)
E9_1 = []
for ee in E9:
    ee_s = set(ee)
    a = C9_S & ee_s
    if len(a) == 2:
        E9_1.append(ee)
for q in C9:
    pos[q] = c[m]
    m += 1
G.add_nodes_from(pos.keys())  # บอกว่าจะเริ่มเพิ่มโหนดตามนี้ โหนดเป็น int
for n, p in pos.iteritems():
    G.node[n]['pos'] = p
for v in E9_1:
    G.add_edge(v[0], v[1])

draw(G, pos, edge_color='c', node_color='Salmon')
# plt.show()
print 'a'
